@echo off
chcp 65001 >nul
CD /d "%~dp0"
color 1F

cls
mode con:cols=70 lines=25
echo "         _        __                   __  _ __  __";
echo "|V| _ __|_)|_  _ /  ___  __|_o _ __  _  _)/ \ _)|_ ";
echo "| |(_)| |  | |_> \__|(/_(_||_|(_)| |_> /__\_//____)";
echo Font Name: Bigfig
pause

color 1F
cls
echo ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
echo.
echo         ßßß    ßßß   ßßßßßß   ßßßßßß   ßßßßßß   ßß   ßß  ßßßßßßß
echo         ßßßß  ßßßß  ßß    ßß  ßß   ßß  ßß   ßß  ßß   ßß  ßß     
echo         ßß ßßßß ßß  ßß    ßß  ßßßßßß   ßßßßßß   ßßßßßßß  ßßßßßßß
echo         ßß  ßß  ßß  ßß    ßß  ßß   ßß  ßß       ßß   ßß       ßß
echo         ßß      ßß   ßßßßßß   ßß   ßß  ßß       ßß   ßß  ßßßßßßß
echo.
echo  ßßßßßß  ßßßßßß  ßßßßßßß   ßßßßß  ßßßßßßßß  ßß  ßßßßßß  ßßß    ßß  ßßßßßßß
echo ßß       ßß   ßß ßß       ßß   ßß    ßß     ßß ßß    ßß ßßßß   ßß  ßß     
echo ßß       ßßßßßß  ßßßßßßß  ßßßßßßß    ßß     ßß ßß    ßß ßß ßß  ßß  ßßßßßßß
echo ßß       ßß   ßß ßß       ßß   ßß    ßß     ßß ßß    ßß ßß  ßß ßß       ßß
echo  ßßßßßß  ßß   ßß ßßßßßßß  ßß   ßß    ßß     ßß  ßßßßßß  ßß   ßßßß  ßßßßßßß
echo.
echo ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
echo Font Name: Straight
pause

cls
echo "_  ____________ _  _____   _________________________  _____   ";
echo "|\/||  ||__/|__]|__|[__    |   |__/|___|__| | ||  ||\ |[__    ";
echo "|  ||__||  \|   |  |___]   |___|  \|___|  | | ||__|| \|___]   ";
echo "                                                              ";
echo Font Name: Cybermedium
pause


cls
mode con:cols=100 lines=25
echo " _ _ _                        __                                  __  __  __  ___";
echo "' ) ) )            /         /  )           _/_                     )/  )   )/   ";
echo " / / / __ __  _   /_  _     /   __  _  __.  /  o __ ____  _     .--'/  /.--''--. ";
echo "/ ' (_(_)/ (_/_)_/ /_/_)_  (__// (_</_(_/|_<__<_(_)/ / <_/_)_  (__ (__/(__  ___) ";
echo "            /                                                                    ";
echo "           '                                                                     ";
echo Font Name: SL Script
pause


cls
echo "___  __ _____ ____________  __  __    ______________ __________ _____ __  __  __   2025";
echo "|| \/ |((   ))||_//||_//||==|| ((    ((   ||_//||== ||=||||  ||((   ))||\\|| ((        ";
echo "||    | \\_// || \\||   ||  ||\_))    \\__|| \\||___|| ||||  || \\_// || \||\_))       ";
echo Font Name: Double Shorts
pause



cls
mode con:cols=130 lines=25
echo " _______ _____  ______ _____ _     ________    _______ ________________________________ _____ __   ________    ";
echo " |  |  ||     ||_____/|_____]|_____||______    |      |_____/|______|_____|   |     |  |     || \  ||______    ";
echo " |  |  ||_____||    \_|      |     |______|    |_____ |    \_|______|     |   |   __|__|_____||  \_|______|    ";
echo "                                                                                                               ";
echo Font Name: Cyberlarge
pause


color 1F
cls
echo ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
echo.
echo         ßßß    ßßß   ßßßßßß   ßßßßßß   ßßßßßß   ßß   ßß  ßßßßßßß
echo         ßßßß  ßßßß  ßß    ßß  ßß   ßß  ßß   ßß  ßß   ßß  ßß     
echo         ßß ßßßß ßß  ßß    ßß  ßßßßßß   ßßßßßß   ßßßßßßß  ßßßßßßß
echo         ßß  ßß  ßß  ßß    ßß  ßß   ßß  ßß       ßß   ßß       ßß
echo         ßß      ßß   ßßßßßß   ßß   ßß  ßß       ßß   ßß  ßßßßßßß
echo.
echo  ßßßßßß  ßßßßßß  ßßßßßßß   ßßßßß  ßßßßßßßß  ßß  ßßßßßß  ßßß    ßß  ßßßßßßß
echo ßß       ßß   ßß ßß       ßß   ßß    ßß     ßß ßß    ßß ßßßß   ßß  ßß     
echo ßß       ßßßßßß  ßßßßßßß  ßßßßßßß    ßß     ßß ßß    ßß ßß ßß  ßß  ßßßßßßß
echo ßß       ßß   ßß ßß       ßß   ßß    ßß     ßß ßß    ßß ßß  ßß ßß       ßß
echo  ßßßßßß  ßß   ßß ßßßßßßß  ßß   ßß    ßß     ßß  ßßßßßß  ßß   ßßßß  ßßßßßßß
echo.
echo ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
echo Font Name: Small 

echo.
echo end of list
pause